ningjw/LPC55S69/core0/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t PWR_CAT1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin A7)  */
    GPIO_PinInit(BOARD_PWR_CAT1_GPIO, BOARD_PWR_CAT1_PORT, BOARD_PWR_CAT1_PIN, &PWR_CAT1_config);

    gpio_pin_config_t ADC_MODE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin G5)  */
    GPIO_PinInit(BOARD_ADC_MODE_GPIO, BOARD_ADC_MODE_PORT, BOARD_ADC_MODE_PIN, &ADC_MODE_config);

    gpio_pin_config_t ADC_FORMAT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin F2)  */
    GPIO_PinInit(BOARD_ADC_FORMAT_GPIO, BOARD_ADC_FORMAT_PORT, BOARD_ADC_FORMAT_PIN, &ADC_FORMAT_config);

    gpio_pin_config_t TMP_SDA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_13 (pin C12)  */
    GPIO_PinInit(BOARD_TMP_SDA_GPIO, BOARD_TMP_SDA_PORT, BOARD_TMP_SDA_PIN, &TMP_SDA_config);

    gpio_pin_config_t TMP_SCL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin C13)  */
    GPIO_PinInit(BOARD_TMP_SCL_GPIO, BOARD_TMP_SCL_PORT, BOARD_TMP_SCL_PIN, &TMP_SCL_config);

    gpio_pin_config_t FLASH_CS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin L2)  */
    GPIO_PinInit(BOARD_FLASH_CS_GPIO, BOARD_FLASH_CS_PORT, BOARD_FLASH_CS_PIN, &FLASH_CS_config);

    gpio_pin_config_t ADC_SYNC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin J2)  */
    GPIO_PinInit(BOARD_ADC_SYNC_GPIO, BOARD_ADC_SYNC_PORT, BOARD_ADC_SYNC_PIN, &ADC_SYNC_config);

    gpio_pin_config_t LINKA_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin E6)  */
    GPIO_PinInit(BOARD_LINKA_GPIO, BOARD_LINKA_PORT, BOARD_LINKA_PIN, &LINKA_config);

    gpio_pin_config_t ADC_RDY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin A12)  */
    GPIO_PinInit(BOARD_ADC_RDY_GPIO, BOARD_ADC_RDY_PORT, BOARD_ADC_RDY_PIN, &ADC_RDY_config);

    gpio_pin_config_t PWR_5V_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin A11)  */
    GPIO_PinInit(BOARD_PWR_5V_GPIO, BOARD_PWR_5V_PORT, BOARD_PWR_5V_PIN, &PWR_5V_config);

    gpio_pin_config_t OverRange_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin E1)  */
    GPIO_PinInit(BOARD_OverRange_GPIO, BOARD_OverRange_PORT, BOARD_OverRange_PIN, &OverRange_config);

    gpio_pin_config_t LED_SYS_GREEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin G12)  */
    GPIO_PinInit(BOARD_LED_SYS_GREEN_GPIO, BOARD_LED_SYS_GREEN_PORT, BOARD_LED_SYS_GREEN_PIN, &LED_SYS_GREEN_config);

    gpio_pin_config_t LED_SYS_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin G13)  */
    GPIO_PinInit(BOARD_LED_SYS_RED_GPIO, BOARD_LED_SYS_RED_PORT, BOARD_LED_SYS_RED_PIN, &LED_SYS_RED_config);

    gpio_pin_config_t PWR_3V3A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin J7)  */
    GPIO_PinInit(BOARD_PWR_3V3A_GPIO, BOARD_PWR_3V3A_PORT, BOARD_PWR_3V3A_PIN, &PWR_3V3A_config);

    gpio_pin_config_t FLASH_WP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin J9)  */
    GPIO_PinInit(BOARD_FLASH_WP_GPIO, BOARD_FLASH_WP_PORT, BOARD_FLASH_WP_PIN, &FLASH_WP_config);

    gpio_pin_config_t PWR_SDA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_21 (pin M7)  */
    GPIO_PinInit(BOARD_PWR_SDA_GPIO, BOARD_PWR_SDA_PORT, BOARD_PWR_SDA_PIN, &PWR_SDA_config);

    gpio_pin_config_t NFC_RSTPD_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_25 (pin B8)  */
    GPIO_PinInit(BOARD_NFC_RSTPD_GPIO, BOARD_NFC_RSTPD_PORT, BOARD_NFC_RSTPD_PIN, &NFC_RSTPD_config);
    /* PIO1_18 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort1Pin18ToPintsel);
    /* PIO1_30 is selected for PINT input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort1Pin30ToPintsel);
    /* PIO0_29 is selected for PINT input 2 */
    INPUTMUX_AttachSignal(INPUTMUX, 2U, kINPUTMUX_GpioPort0Pin29ToPintsel);
    /* Ctimer input 0 is selected for Secure TIMER1 CAPTSEL 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_CtimerInp0ToTimer1Captsel);

